/*
 *  여러줄 주석
 *  1. 자바 실행 과정
 *  	.java   ->class명과 동일해야 함(MainCalss_1.java)
 *  	----원시소스 (프로그래머만 아는 언어): 컴퓨터는 알 수 없는 소스
 *  	|
 *  	| 컴퓨터가 인식하는 언어로 변경(컴파일) ->javac
 *  	.class -> 바이트코드 (기계어)
 *  	|
 *  	| 한줄씩 번역 (인터프리터)-> java 이용
 *   	번역된 내용을 화면에 출력
 *   	-------- javac + java -> Ctrl+F11 
 *  2. 자바 사용
 *  	1) 호환성 높음(운영체제에 상관 없이 작동) => 운영체제의 독립적이다.
 *  	2) 무료(jdk1.8) => jdk 1.9(오라클에서 제작) => 라이센스 있음
 *  	3) 버전호환
 *  3. 자바의 발전과정(백서): 1995/5/23 시작-> 1996(JavaApplet)이 우리나라에 먼저 사용=> 동적 웹
 *     분당/판교, 강남, 상암, 구디/가디에 많음(SI/SM)
 *     -->솔루션 많음
 *     자바
 *     오라클
 *     HTML/CSS/JS
 *     Ajax / Jquery
 *     Jsp
 *     MVC
 *     --------------1차
 *     Spring
 *     VueJS
 *     ---------------2차
 *     Spring_Boot
 *     react
 *     ---------------3차
 *    
 *    자바: 가전제품(게임기: 세븐스타) ->임베디드(모바일)
 *    	=>그린 프로젝트(통합 리모콘)-> 후원자X -> 망함
 *     	=>네스케이프 인수(브라우저) ----> 웹프로그램 개발(자바스크립트)  
 *     	=> 독립(자바)<-경쟁--> MS
 *     -----------
 *     		운영체제(솔라리스, 언어) ==>데이터베이스(MySQL) 인수 과정 부도 -> 오라클 인수->유료화 시킴
 *     			openjdk / jdk
 *     			-----
 *     	=> 제임스 고슬링 / 아서벤
 *     		JA			VA => java
 *     		=> c++ / Java 객체지향(사람중심) ==> C++(C문법) -> javah
 *     			---
 *     			C With Class => 객체 지향(기계)
 *    4. 자바 특징(면접준비): 3p
 */
// 한줄 주석
public class MainClass_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		System.out.println("Hello Java!!");
		
	}

}
